<?php
const ERROR = [
   '101' => 'error101：DB接続でエラーが発生いたしました。<br>　　　　　　DBの接続を確認してください。',
   '102' => 'error102：登録されているデータ件数が０件でした。<br>　　　　　　まずは登録をしてください。',
   '201' => 'error201：DB接続でエラーが発生いたしました。<br>　　　　　　DBの接続を確認してください。',
   '202' => 'error202：INSERTに失敗しました。<br>　　　　　　INSERT内容を確認してください。',
   '209' => 'error209：画像のアップロードに失敗しました。<br>　　　　　　画像のサイズなどを確認してください。',
   '301' => 'error301：DB接続でエラーが発生いたしました。<br>　　　　　　DBの接続を確認してください。',
   '302' => 'error302：UPDATEに失敗しました。<br>　　　　　　UPDATE内容を確認してください。',
   '305' => 'error305：列名と値の数が不一致でした。<br>　　　　　　UPDATE内容を確認してください。',
   '309' => 'error309：画像のアップロードに失敗しました。<br>　　　　　　画像のサイズなどを確認してください。',
   '401' => 'error401：DB接続でエラーが発生いたしました。<br>　　　　　　DBの接続を確認してください。',
   '402' => 'error402：DELETEに失敗しました。<br>　　　　　　DELETE内容を確認してください。',
];
?>
